lifeline01/STM32Demo/STM32_DEMO_IICSoft/HARDWARE/MPU6050.h
#ifndef _MPU6050_H_
#define _MPU6050_H_


#include "stm32f10x.h"                  // Device header

// 写地址
#define  MPU6050_ADDRESS			0xD0		//MPU6050的I2C从机地址

// 寄存器地址
#define	MPU6050_SMPLRT_DIV		0x19
#define	MPU6050_CONFIG				0x1A
#define	MPU6050_GYRO_CONFIG		0x1B
#define	MPU6050_ACCEL_CONFIG		0x1C

#define	MPU6050_ACCEL_XOUT_H		0x3B
#define	MPU6050_ACCEL_XOUT_L		0x3C
#define	MPU6050_ACCEL_YOUT_H		0x3D
#define	MPU6050_ACCEL_YOUT_L		0x3E
#define	MPU6050_ACCEL_ZOUT_H		0x3F
#define	MPU6050_ACCEL_ZOUT_L		0x40
#define	MPU6050_TEMP_OUT_H		0x41
#define	MPU6050_TEMP_OUT_L		0x42
#define	MPU6050_GYRO_XOUT_H		0x43
#define	MPU6050_GYRO_XOUT_L		0x44
#define	MPU6050_GYRO_YOUT_H		0x45
#define	MPU6050_GYRO_YOUT_L		0x46
#define	MPU6050_GYRO_ZOUT_H		0x47
#define	MPU6050_GYRO_ZOUT_L		0x48

#define	MPU6050_PWR_MGMT_1		0x6B
#define	MPU6050_PWR_MGMT_2		0x6C
#define	MPU6050_WHO_AM_I			0x75


void MPU6050_WriteReg(uint8_t RegAddress, uint8_t Data);
uint8_t MPU6050_ReadReg(uint8_t RegAddress);
void MPU6050_Init(void);

void MPU6050_Init(void);
uint8_t MPU6050_GetID(void);
void MPU6050_GetData(int16_t *AccX, int16_t *AccY, int16_t *AccZ, int16_t *GyroX, int16_t *GyroY, int16_t *GyroZ);



#endif

